ci4/app/Controllers/SiswaController.php

SELECT *
FROM `siswa`
---
    public function index()
    {
        $model = new SiswaModel();
        $data['siswa'] = $model->findAll();

INSERT INTO `siswa` (`nama`, `email`, `no_hp`, `created_at`, `updated_at`) VALUES ('Luqman', 'luqmanasyari18@gmail.com', '08975556666', '2024-10-10 03:06:36', '2024-10-10 03:06:36')
---
    public function store()
    {
        $model = new SiswaModel();

        $data = [
            'nama' => $this->request->getPost('nama'),
            'email' => $this->request->getPost('email'),
            'no_hp' => $this->request->getPost('no_hp')
        ];

        $model->save($data);

SELECT *
FROM `siswa`
WHERE `siswa`.`id` = '1'
---
    public function edit($id)
    {
        $model = new SiswaModel();
        $data['siswa'] = $model->find($id);

DELETE FROM `siswa`
WHERE `id` IN ('1')
---
    public function delete($id)
    {
        $model = new SiswaModel();
        $model->delete($id);